openresty/openresty-systemtap-toolkit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-05 四 16:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>openresty-systemtap-toolkit</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">openresty-systemtap-toolkit</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3d9f9f9">1. 概述</a></li>
<li><a href="#orga3243b7">2. 安装</a>
<ul>
<li><a href="#org4d6b047">2.1. 内核调试符号和内核头文件</a></li>
<li><a href="#orgaa3e8af">2.2. systemtap</a></li>
<li><a href="#org80983c5">2.3. nginx</a></li>
</ul>
</li>
<li><a href="#orga185985">3. openresty-systemtap-toolkit</a>
<ul>
<li><a href="#orga6fc955">3.1. sample-bt</a></li>
<li><a href="#orga3ddefb">3.2. ngx-sample-lua-bt</a></li>
<li><a href="#orgb9f83c3">3.3. ngx-lua-bt</a></li>
</ul>
</li>
<li><a href="#orgbfa1b6d">4. stampxx</a>
<ul>
<li><a href="#org6bf89f3">4.1. lj-lua-stacks</a></li>
</ul>
</li>
<li><a href="#org7c59fd1">5. FlameGraph</a></li>
<li><a href="#org3981d48">6. 问题</a>
<ul>
<li><a href="#orgf830999">6.1. 问题一</a></li>
<li><a href="#org447c504">6.2. 问题二</a></li>
<li><a href="#orgcb616ee">6.3. 问题三</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3d9f9f9" class="outline-2">
<h2 id="org3d9f9f9"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/openresty/openresty-systemtap-toolkit">openresty-systemtap-toolkit</a> 是基于 SystemTap 的 OpenResty（包括 NGINX，LuaJIT，ngx_lua 等）实时分析和诊断工具。本文主要来自<a href="https://github.com/openresty/openresty-systemtap-toolkit/blob/master/README-CN.markdown">中文 manual</a> 和一些日常实践。
</p>

<p>
此外，强烈建议阅读章亦春所写 <a href="https://openresty.org/posts/dynamic-tracing/">《动态追踪技术漫谈》</a> ，扩展相关知识点。
</p>
</div>
</div>

<div id="outline-container-orga3243b7" class="outline-2">
<h2 id="orga3243b7"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4d6b047" class="outline-3">
<h3 id="org4d6b047"><span class="section-number-3">2.1</span> 内核调试符号和内核头文件</h3>
<div class="outline-text-3" id="text-2-1">
<p>
需要安装内核调试符号和内核头文件。通常，您只需要分别从 Linux 发行版中获取 kernel-devel 和 kernel-debuginfo 包（与当前的内核包匹配）。
</p>

<p>
<a href="http://debuginfo.centos.org/">下载</a> 当前内核版本对应的开发包和调试包，然后安装：
</p>
<div class="org-src-container">
<pre class="src src-sh">rpm -ivh kernel-devel-$(<span style="color: #fa8072;">uname</span> -r).rpm <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">&#36825;&#20010;&#26159;&#20174;&#21738;&#37324;&#19979;&#36733;&#30340;&#65311;</span>
rpm -ivh kernel-debuginfo-common-x86_64-$(<span style="color: #fa8072;">uname</span> -r).rpm
rpm -ivh kernel-debuginfo-$(<span style="color: #fa8072;">uname</span> -r).rpm
</pre>
</div>

<p>
如果 Linux 内核版本低于 3.5，那么可能需要给内核打上这个补丁（如果之前没有打的话）： <a href="http://sourceware.org/systemtap/wiki/utrace">utrace</a> ，这样才能让 systemtap 安装得到用户空间追踪的支持。但是如果使用的是 RedHat 系列的 Linux 发行版本（比如 RHEL, CentOS 和 Fedora），那么旧的内核也应该已经安装了 utrace 这个补丁。
</p>

<p>
3.5+ 主流 Linux 内核支持用户空间跟踪的 uprobes API。
</p>
</div>
</div>

<div id="outline-container-orgaa3e8af" class="outline-3">
<h3 id="orgaa3e8af"><span class="section-number-3">2.2</span> systemtap</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Linux 系统需要 systemtap 2.1 + 和 perl 5.6.1+。要从源代码构建最新的 systemtap，请参阅此文档：http：//openresty.org/#BuildSystemtap。
</p>

<div class="org-src-container">
<pre class="src src-sh">yum intall systemtap
stap --version
</pre>
</div>

<p>
stap-prep 命令可以帮你安装需要的依赖，主要是 kernel-devel 和 kernel-debuginfo，版本要匹配。
</p>

<p>
运行基于 systemtap 的工具集需要特别的用户权限。为了避免用 root 用户运行这些工具集，你可以把自己的用户名（非 root 用户），加入到 stapusr 和 staprun 用户组中。 但是如果你自己的账户名和 正在运行 NGINX 进程的账户名不同，那么你还是需要运行 "sudo" 或者其他同样效果的命令，让这些工具集带有 root 访问权限的运行起来。
</p>

<p>
测试 systemtap 安装成功否：
</p>
<div class="org-src-container">
<pre class="src src-sh">stap -v -e <span style="color: #ff4ea3;">'probe vfs.read {printf("read performed\n"); exit()}'</span>
</pre>
</div>

<pre class="example">
   Pass 1: parsed user script and 119 library script(s) using 214120virt/41576res/3224shr/39032data kb, in 370usr/50sys/579real ms.
   Pass 2: analyzed script: 1 probe(s), 1 function(s), 4 embed(s), 0 global(s) using 310820virt/139252res/4248shr/135732data kb, in 1350usr/370sys/2962real ms.
   Pass 3: translated to C into "/tmp/stapypKNOW/stap_1b07fe71dc2219eeaad228cb70ad26cc_1625_src.c" using 310820virt/139612res/4608shr/135732data kb, in 10usr/60sys/75real ms.
   Pass 4: compiled C into "stap_1b07fe71dc2219eeaad228cb70ad26cc_1625.ko" in 6570usr/1000sys/10339real ms.
   Pass 5: starting run.
   read performed
   Pass 5: run completed in 0usr/10sys/436real ms.
</pre>
</div>
</div>

<div id="outline-container-org80983c5" class="outline-3">
<h3 id="org80983c5"><span class="section-number-3">2.3</span> nginx</h3>
<div class="outline-text-3" id="text-2-3">
<p>
此外，如果您没有从源代码编译 Nginx，则应确保 Nginx（和其他依赖项）已启用（或单独安装）的（DWARF）debuginfo。推荐直接使用 openresty 源码进行编译。
</p>
</div>
</div>
</div>

<div id="outline-container-orga185985" class="outline-2">
<h2 id="orga185985"><span class="section-number-2">3</span> openresty-systemtap-toolkit</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga6fc955" class="outline-3">
<h3 id="orga6fc955"><span class="section-number-3">3.1</span> sample-bt</h3>
<div class="outline-text-3" id="text-3-1">
<p>
这个脚本可以对你指定的任意用户进程（没错，不仅仅是 NGINX！）进行调用栈的采样。调用栈可以是用户空间，可以是内核空间，或者是两者兼得。 它的输出是汇总后的调用栈（按照总数）。
</p>

<div class="org-src-container">
<pre class="src src-sh">sample-bt -p PID -t 5 -u &gt; a.bt
</pre>
</div>

<p>
-t 代表监测 10s，-u 表示监测用户态，-k 表示监测内核态，结束后结果重定向到 a.bt 中，然后需要用工具来讲结果转换成火焰图。
</p>
</div>
</div>

<div id="outline-container-orga3ddefb" class="outline-3">
<h3 id="orga3ddefb"><span class="section-number-3">3.2</span> ngx-sample-lua-bt</h3>
<div class="outline-text-3" id="text-3-2">
<p>
和 sample-bt 这个脚本类似, 不过采样的是 Lua 语言级别的调用栈。
</p>

<p>
警告 这个工具只能和解释后的 Lua 代码工作，并且有很多的限制。 对于 LuaJIT 2.1，推荐使用 stampxx 项目的 lj-lua-stacks 工具来采样解释后（或编译后）的 Lua 代码。
</p>

<p>
当你在 NGINX 里面使用标准的 Lua 5.1 解释器时，需要指定 &#x2013;lua51 选项；如果用的是 LuaJIT 2.0 就指定 &#x2013;luajit20。
</p>

<p>
这个脚本生成的 Lua 调用栈，在 Lua 函数定义的地方会使用 Lua 代码源文件名和所在行数。 所以为了获得更有意义的调用信息，你可以调用 fix-lua-bt 脚本去处理 ngx-sample-lua-bt 的输出。
</p>

<p>
这里有一个例子，NGINX 使用的是标准 Lua 5.1 解释器：
</p>
<pre class="example">
# sample at 1K Hz for 5 seconds, assuming the Nginx worker
#   or master process pid is 9766.
$ ./ngx-sample-lua-bt -p 9766 --lua51 -t 5 &gt; tmp.bt
WARNING: Tracing 9766 (/opt/nginx/sbin/nginx) for standard Lua 5.1...
WARNING: Time's up. Quitting now...(it may take a while)

$ ./fix-lua-bt tmp.bt &gt; a.bt
</pre>

<p>
如果使用的是 LuaJIT 2.0:
</p>
<pre class="example">
# sample at 1K Hz for 5 seconds, assuming the Nginx worker
#   or master process pid is 9768.
$ ./ngx-sample-lua-bt -p 9768 --luajit20 -t 5 &gt; tmp.bt
WARNING: Tracing 9766 (/opt/nginx/sbin/nginx) for LuaJIT 2.0...
WARNING: Time's up. Quitting now...(it may take a while)

$ ./fix-lua-bt tmp.bt &gt; a.bt
</pre>
</div>
</div>

<div id="outline-container-orgb9f83c3" class="outline-3">
<h3 id="orgb9f83c3"><span class="section-number-3">3.3</span> ngx-lua-bt</h3>
<div class="outline-text-3" id="text-3-3">
<p>
这个工具可以把 NGINX worker 进程中 Lua 的当前调用栈 dump 出来。
</p>

<p>
这个工具在定位 Lua 热循环引起的 NGINX worker 持续 100% CPU 占用问题的时候非常有效。
</p>

<p>
如果用的是 LuaJIT 2.0, 请指定 &#x2013;luajit20 选项, 像这样:
</p>
<pre class="example">
$ ./ngx-lua-bt -p 7599 --luajit20
WARNING: Tracing 7599 (/opt/nginx/sbin/nginx) for LuaJIT 2.0...
C:lj_cf_string_find
content_by_lua:2
content_by_lua:1
</pre>

<p>
如果用的是标准 Lua 5.1 解释器, 请指定 &#x2013;lua51 选项:
</p>
<pre class="example">
$ ./ngx-lua-bt -p 13611 --lua51
WARNING: Tracing 13611 (/opt/nginx/sbin/nginx) for standard Lua 5.1...
C:str_find
content_by_lua:2
[tail]
content_by_lua:1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbfa1b6d" class="outline-2">
<h2 id="orgbfa1b6d"><span class="section-number-2">4</span> stampxx</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://github.com/openresty/stapxx#lj-lua-stacks">stampxx</a> 是一门宏标记语言，用来扩展 systemtap。
</p>
</div>

<div id="outline-container-org6bf89f3" class="outline-3">
<h3 id="org6bf89f3"><span class="section-number-3">4.1</span> lj-lua-stacks</h3>
<div class="outline-text-3" id="text-4-1">
<p>
此工具在 LuaJIT 2.1 VM 中对 Lua 调用栈进行采样，这些 luajit 可以运行于指定 luajit 进程或 nginx 工作进程（使用 ngx_lua 模块）上 。根据 CPU 时间使用情况使用 Linux 内核的计时器挂钩 API 进行相对均匀的采样。
</p>

<p>
它在采样过程中聚合了理想的 Lua 调用栈，因此最终的输出数据不会很大。
</p>

<p>
只要目标 C 程序将主 Lua VM 状态（lua_State）指针保存在名为 globalL 的全局 C 变量中，就像在标准 luajit 命令行实用程序中一样，此工具也可以分析其他带有 LuaJIT 嵌入式的自定义 C 进程。。
</p>

<div class="org-src-container">
<pre class="src src-sh">lj-lua-stacks.sxx --arg <span style="color: #ff8700;">time</span>=5 --skip-badvars -x 8910 &gt; tmp.bt
</pre>
</div>

<p>
下面是一些示例：
</p>
<pre class="example">
# making the ./stap++ tool visible in PATH:
$ export PATH=$PWD:$PATH

# assuming the nginx worker process pid is 6949:
$ ./samples/lj-lua-stacks.sxx --skip-badvars -x 6949 &gt; a.bt
Start tracing 6949 (/opt/nginx/sbin/nginx)
Hit Ctrl-C to end.
^C
</pre>

<p>
默认情况下，该工具将保持采样，直到您按 Ctrl-C。您还可以指定 <code>--arg time = N</code> 选项，让工具在 N 秒后自动退出。例如，
</p>
<pre class="example">
$ ./samples/lj-lua-stacks.sxx --arg time=5 --skip-badvars -x 6949 &gt; a.bt
Start tracing 6949 (/opt/nginx/sbin/nginx)
Please wait for 5 seconds
</pre>
<p>
输出内容可以使用 FlameGraph 工具可视化。
</p>
</div>
</div>
</div>

<div id="outline-container-org7c59fd1" class="outline-2">
<h2 id="org7c59fd1"><span class="section-number-2">5</span> FlameGraph</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://github.com/brendangregg/FlameGraph">FlameGraph</a> 中包含多个火焰图生成工具，其中，stackcollapse-stap.pl 才是为 SystemTap 抓取的栈信息的生成工具。
</p>

<div class="org-src-container">
<pre class="src src-sh">FlameGraph/stackcollapse-stap.pl a.bt &gt; a.cbt;
FlameGraph/flamegraph.pl a.cbt &gt; a.svg
</pre>
</div>
</div>
</div>

<div id="outline-container-org3981d48" class="outline-2">
<h2 id="org3981d48"><span class="section-number-2">6</span> 问题</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgf830999" class="outline-3">
<h3 id="orgf830999"><span class="section-number-3">6.1</span> 问题一</h3>
<div class="outline-text-3" id="text-6-1">
<pre class="example">
   # ./samples/lj-lua-stacks.sxx --arg time=5 --skip-badvars -x 8910 &gt; tmp.bt

   ./samples/lj-lua-stacks.sxx: line 3: cannot find @use library nginx.lua
</pre>

<blockquote>
<p>
原因：Getting this error usually means you've manually moved stap++ out of its original stapxx source tree. Better set your PATH environment properly without moving stap++ out of its tree.
</p>
</blockquote>

<p>
解决办法：将 stap++所在目录添加到 PATH 环境变量。
</p>
</div>
</div>

<div id="outline-container-org447c504" class="outline-3">
<h3 id="org447c504"><span class="section-number-3">6.2</span> 问题二</h3>
<div class="outline-text-3" id="text-6-2">
<blockquote>
<p>
./samples/lj-lua-stacks.sxx &#x2013;arg time=5 &#x2013;skip-badvars -x 7610 &gt; tmp.bt
Found exact match for libluajit: /usr/local/luajit/lib/libluajit-5.1.so.2.0.2
WARNING: cannot find module /usr/local/nginx-1.10.2/sbin/nginx debuginfo: No DWARF information found [man warning::debuginfo]
WARNING: cannot find module /usr/local/luajit/lib/libluajit-5.1.so.2.0.2 debuginfo: No DWARF information found [man warning::debuginfo]
semantic error: while processing function luajit_G
</p>

<p>
semantic error: type definition 'lua_State' not found in '/usr/local/luajit/lib/libluajit-5.1.so.2.0.2': operator '@cast' at stapxx-FbE4EFNi/luajit.stp:162:12
source:     return @cast(L, "lua_State", "/usr/local/luajit/lib/libluajit-5.1.so.2.0.2")-&gt;glref-&gt;ptr32
^
</p>

<p>
Pass 2: analysis failed.  [man error::pass2]
Number of similar warning messages suppressed: 634.
Rerun with -v to see them.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgcb616ee" class="outline-3">
<h3 id="orgcb616ee"><span class="section-number-3">6.3</span> 问题三</h3>
<div class="outline-text-3" id="text-6-3">
<pre class="example">
   ngx-sample-lua-bt -p 8729 -t 10 --lua51 &gt;/tmp/a.bt
   WARNING: cannot find module /usr/local/lib/liblua.so debuginfo: No DWARF information found [man warning::debuginfo]
   WARNING: Bad $context variable being substituted with literal 0: identifier '$L' at &lt;input&gt;:18:30
   source:         lua_states[my_pid] = $L
                                      ^
   semantic error: while processing function ci_func

   semantic error: type definition 'CallInfo' not found in '/usr/local/lib/liblua.so': operator '@cast' at :48:20
        source:     return clvalue(@cast(ci, "CallInfo", "/usr/local/lib/liblua.so")-&gt;func)
                                   ^

   Pass 2: analysis failed.  [man error::pass2]

</pre>

<p>
缺少 lua debug 信息，但是如何安装还不了解。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-05 四 16:59</p>
<p class="validation"></p>
</div>
</body>
</html>
